---
kind: property
id: P:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionRotationAngle
source: html/d25dc463-5722-7434-05c7-4986b0a08d66.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionRotationAngle Property

Angle by which both u- and v- gridlines of the division are rotated with respect
 to the natural u/v-const directions of the sketch plane.

## Syntax (C#)
```csharp
public double DivisionRotationAngle { get; set; }
```